ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3ca65aa4-c7cb-495d-a638-7156c2505c56">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e50af2f-d7e6-4349-bd07-de9f379b59ea">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4cf8df9a-00e8-4a44-927e-f716e3f92152">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f821681-4f9b-4186-85f8-a081e4ab09cf">
    <name>ПотреблениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22ea815e-ceda-4730-8b5e-62907ac780b9">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="403f50d0-8b0d-48d0-846b-e3acd469e6ba">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="970ef82a-a100-41c6-9d78-1820500623ef">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f4e40a70-ee92-44b0-81ab-620e322cc59e">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd57705d-9296-4fd2-b7a9-15f6488b8c57">
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="930f6e33-ad27-42aa-847a-055d575b4e7a">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ea81d61-a145-412f-a8d3-64a9f0a8575a">
    <name>ИТБК_ЭтоДоизготовление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6c8878e4-d524-4562-a1aa-fed22e574999">
    <name>ИТБК_Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2da95c32-1e17-4645-af3e-d147e497a51a">
    <name>ИТБК_Доизготовление</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ad014de0-f2d0-4d78-a5e5-13184507d86e">
      <name>Отказ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f8b20593-09b5-473d-bd46-aad89cfeb805">
      <name>ТребуетсяДоизготовить</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bce64abb-cf66-45ef-95f8-a5cc4d93ad03">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6a2d5905-8cb8-4cad-9e41-4662ba390714">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="35daa3d5-4599-4243-8b70-887e8586f4dc">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1a17a382-e007-451e-a927-e28dc79bc609">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="763d483f-cd6b-475a-9169-bb3dc9be7d0c">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8cc00691-f4a4-462a-8822-9ab1dbd65381">
      <name>ИнвентарныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a5d734bf-f6f9-4185-8e9a-4c27d5c1df58">
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8cf5a97a-57f7-4e01-8f1a-8c0d2d083ddd">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2028db10-05a3-4bf0-a844-a72d9652af30">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cf129010-88b1-4266-9016-024fb4771e67">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6d2c208d-6ee2-414d-bfb1-35f948f665e5">
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="54be410d-2466-478e-8cf5-434ec98e19f1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1b8217a5-5b59-453d-b479-c9c962e72312">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c0ba3d8b-b4f5-41e8-b33f-553ec895843c">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93927e35-fae9-4bc2-9760-4eaedd94bda8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0534f986-283f-458c-b7f4-990361620b4c">
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3dc4c4e8-1141-4c3c-95fd-9a8722f0d2d8">
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b65d63f2-da8e-4c68-8704-bf8da3a91e37">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0da3af76-0f90-43fc-bf8d-6d86f1169900">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="52f8b83e-8cd7-41e0-854c-e53d2895c8af">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="93c1633a-6891-4885-bf05-afd51450f110">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.ИТБК_/src/AccumulationRegisters/ИТБК_Доизготовление/ИТБК_Доизготовление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6cc4e35a-f35a-4ee0-bcad-2c14bfad02e7">
  <name>ИТБК_Доизготовление</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="054946e0-b321-4a0a-a7d4-9e2a4518a176">
    <name>Доизготовить</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="0a3560cd-b27b-4410-931c-e3cec43e3c9e">
    <name>АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cc8115e6-fda0-4ac6-9fd8-6459f7625bf5">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.ИТБК_/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Enums/СтатусыСборокТоваров/СтатусыСборокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d32e7159-13c4-4ac8-9058-9848ec019475">
  <name>СтатусыСборокТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c5d672fd-488c-4858-89d0-05a9afcde29b">
    <name>ВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="73cc6264-ff74-4ff1-a2a7-0fd6e2fc6e85">
    <name>СобраноРазобрано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/ВнутреннееПотребление/Forms/ИТБК_ФормаДоизготовление/Module.bsl
&НаСервере
Процедура ИТБК_АктИзготовленияПриИзмененииНаСервере()
    
    ЗаполнитьТч();
    
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_АктИзготовленияПриИзменении(Элемент)
    
    ИТБК_АктИзготовленияПриИзмененииНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТч()
    
    Объект.Товары.Очистить();   
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ИТБК_Доизготовление.ДоизготовитьОстаток КАК ТребуетсяДоизготовить,
    |	ИТБК_Доизготовление.АктИзготовления.Номенклатура КАК АналитикаРасходов,
    |	ИТБК_Доизготовление.ДоизготовитьОстаток КАК Количество,
    |	ИТБК_Доизготовление.Номенклатура КАК Номенклатура,
    |	ИТБК_СтатьяДоизготовления.Значение КАК СтатьяРасходов
    |ИЗ
    |	РегистрНакопления.ИТБК_Доизготовление.Остатки(, АктИзготовления = &Акт) КАК ИТБК_Доизготовление,
    |	Константа.ИТБК_СтатьяДоизготовления КАК ИТБК_СтатьяДоизготовления Где ИТБК_Доизготовление.ДоизготовитьОстаток > 0";
    
    Запрос.УстановитьПараметр("Акт", Объект.ИТБК_АктИзготовления);
    Запрос.УстановитьПараметр("Склад", 	Объект.Склад);    // begin fix Designer 10.04.2023 15:56:11
	Запрос.УстановитьПараметр("Дата", Новый Граница(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, КонецДня(ТекущаяДатаСеанса())), ВидГраницы.Включая));
	
	Объект.Дата = Запрос.Параметры.Дата.Значение;
	
	Запрос.Текст = "
    |ВЫБРАТЬ
    |	ИТБК_Доизготовление.АктИзготовления.Номенклатура 	КАК АналитикаРасходов,
    |	ИТБК_СтатьяДоизготовления.Значение 					КАК СтатьяРасходов,
    |	ИТБК_Доизготовление.Номенклатура 					КАК Номенклатура,
    |	ТоварыНаСкладахОстатки.Характеристика 				КАК Характеристика,
    |	ТоварыНаСкладахОстатки.Серия 						КАК Серия,
	|	ТоварыНаСкладахОстатки.Назначение 					КАК Назначение,
	|	ИТБК_Доизготовление.ДоизготовитьОстаток 			КАК ТребуетсяДоизготовить,
    |	ВЫБОР
    |		КОГДА ЕСТЬNULL(ИТБК_Доизготовление.ДоизготовитьОстаток,0) < ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0)
    |			ТОГДА ЕСТЬNULL(ИТБК_Доизготовление.ДоизготовитьОстаток,0)
    |		ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0)
    |	КОНЕЦ 												КАК Количество,
	|	0 													КАК Отказ,
	|	СпрВидыНоменклатуры.ИспользоватьСерии 				КАК ИспользоватьСерии
    |ИЗ
    |	РегистрНакопления.ИТБК_Доизготовление.Остатки(&Дата, АктИзготовления = &Акт) КАК ИТБК_Доизготовление
    |		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ИТБК_СтатьяДоизготовления КАК ИТБК_СтатьяДоизготовления
    |		ПО (ИСТИНА)
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК ТоварыНаСкладахОстатки
    |		ПО (ИТБК_Доизготовление.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СпрВидыНоменклатуры
	|				ПО (СпрНоменклатура.ВидНоменклатуры = СпрВидыНоменклатуры.Ссылка)
	|			ПО (ИТБК_Доизготовление.Номенклатура = СпрНоменклатура.Ссылка)
    |ГДЕ
    |	ИТБК_Доизготовление.ДоизготовитьОстаток > 0
	|	И ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) >= 0
    |
    |УПОРЯДОЧИТЬ ПО
    |	Номенклатура,
    |	Характеристика,
	|   Серия,
	|   ТребуетсяДоизготовить,
    |	Количество ";	// УБЫВ  
	
	//|	ИТБК_Доизготовление.ДоизготовитьОстаток -
	//|	ЕСТЬNULL(ВЫБОР
	//|		КОГДА ИТБК_Доизготовление.ДоизготовитьОстаток < ТоварыНаСкладахОстатки.ВНаличииОстаток
	//|			ТОГДА ИТБК_Доизготовление.ДоизготовитьОстаток
	//|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	//|	КОНЕЦ,0) КАК Отказ
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	сч = ТЗ.Количество();
	ИспользованныйОтбор = Новый ТаблицаЗначений();
	ИспользованныйОтбор.Колонки.Добавить("Номенклатура");
	ИспользованныйОтбор.Колонки.Добавить("Характеристика");
	Пока сч>0 Цикл
		сч = сч - 1;
		Если Не ТЗ[сч].ИспользоватьСерии Тогда Продолжить; КонецЕсли;
		С = Новый Структура();
		С.Вставить("Номенклатура", ТЗ[сч].Номенклатура);
		С.Вставить("Характеристика", ТЗ[сч].Характеристика);
		Если ИспользованныйОтбор.НайтиСтроки(С).Количество() Тогда
			Продолжить;
		КонецЕсли;
		ИскКол = ТЗ[сч].ТребуетсяДоизготовить;
		ИскСтр = ТЗ.НайтиСтроки(С);
		Если ИскСтр.Количество() = 1 Тогда 
			Если ИскКол = 1 Тогда 
				Продолжить; 
			КонецЕсли;
			Для поз=2 По ИскКол Цикл
				НСтр = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр,ИскСтр[0]);
				НСтр.ТребуетсяДоизготовить=1;	
			КонецЦикла;
			Продолжить; 
		КонецЕсли;
		 
		Для каждого Стр Из ИскСтр Цикл
			Если ИскКол = 0 Тогда
				ТЗ.Удалить(Стр);
				Продолжить;
			КонецЕсли;
			ИскКол = ИскКол - Стр.Количество;
			Если ИскКол <= 0 Тогда
				Стр.Количество = Стр.Количество + ИскКол;
				Стр.ТребуетсяДоизготовить = Стр.Количество;
				ИскКол = 0;
			Иначе
				Стр.ТребуетсяДоизготовить = Стр.Количество;	
			КонецЕсли;
			Если Стр.Количество = 0 Тогда
				ТЗ.Удалить(Стр);
			КонецЕсли;
		КонецЦикла;
		Если ИскКол > 0 Тогда
			Для поз=1 По ИскКол Цикл
				НСтр = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр,ИскСтр[0]);
				НСтр.ТребуетсяДоизготовить=1;	
			КонецЦикла;	
		КонецЕсли;	
		сч = Мин(Сч,ТЗ.Количество());
		СТЗ=ИспользованныйОтбор.Добавить();
		ЗаполнитьЗначенияСвойств(СТЗ,С);
	КонецЦикла;
	С = Новый Структура();
	С.Вставить("ТребуетсяДоизготовить", 0);
	ИскСтр = ТЗ.НайтиСтроки(С);
	Для каждого Стр Из ИскСтр Цикл
		ТЗ.Удалить(Стр);
	КонецЦикла;
    Объект.ИТБК_Доизготовление.Загрузить(ТЗ); 
	Объект.vs_Доизготовление.Загрузить(ТЗ);
   	// end fix Designer 10.04.2023 15:56:22 
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    отказ = истина; возврат;
    Если объект.Ссылка.Пустая() тогда
        Объект.ИТБК_ЭтоДоизготовление = Истина;
		Объект.vs_ЭтоДоизготовление = Истина;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    отказ = истина; возврат;
    Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
        Возврат;
    КонецЕсли;
    
    ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
    
    
    // СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
    
	ПриЧтенииСозданииНаСервере();   // fix Designer09.09.2021 4:40:58
    
    Если Элементы.ХозяйственнаяОперация.СписокВыбора.Количество() = 1 Тогда
        Элементы.ХозяйственнаяОперация.Видимость = Ложь;
    КонецЕсли;
    
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
    // ИнтеграцияС1СДокументооборотом
    ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
    // Конец ИнтеграцияС1СДокументооборотом
    
	// Выбор статей и аналитик.
	//ПараметрыВыбораСтатейИАналитик = Документы.ВнутреннееПотребление.ПараметрыВыбораСтатейИАналитик(Объект.ХозяйственнаяОперация);
	//ДоходыИРасходыСервер.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	// Выбор статей и аналитик.
	ПараметрыВыбораСтатейИАналитик = Документы.ВнутреннееПотребление.ПараметрыВыбораСтатейИАналитик_ИТБК_Доизготовление(Объект.ХозяйственнаяОперация);
	//ПараметрыВыбораСтатейИАналитик = Документы.ВнутреннееПотребление.ПараметрыВыбораСтатейИАналитик_vs_Доизготовление(Объект.ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
    ВнутреннееПотреблениеЛокализация.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
    
    СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Параметры.Свойство("ПараметрКоманды") тогда
		объект.ИТБК_АктИзготовления = Параметры.ПараметрКоманды;
		объект.vs_АктИзготовления = Параметры.ПараметрКоманды;  //????????????????????????????????????????
		объект.Склад = объект.ИТБК_АктИзготовления.Склад;
		объект.Организация = объект.ИТБК_АктИзготовления.Организация;
		объект.Подразделение = объект.ИТБК_АктИзготовления.Подразделение;
		ИТБК_АктИзготовленияПриИзмененииНаСервере();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры


&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_ДоизготовлениеСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    ОткрытьФорму("Обработка.Автоизготовление.Форма.выборСерии",новый Структура("Ном",Элементы.ИТБК_Доизготовление.ТекущиеДанные.Номенклатура),Элемент);
    
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_ДоизготовлениеПередУдалением(Элемент, Отказ)
//    Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_ДоизготовлениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	 Если Копирование тогда   Отказ = Истина;  КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_ДоизготовлениеОтказПриИзменении(Элемент) 
	ТД = Элементы.ИТБК_Доизготовление.ТекущиеДанные ;
	Если не ЗначениеЗаполнено(ТД.Серия) Тогда
	   	Если ТД.Отказ <> 0 и ТД.Отказ > ТД.ТребуетсяДоизготовить - ТД.Количество тогда
	        ТД.Отказ  =  ТД.ТребуетсяДоизготовить - ТД.Количество ;
			ПоказатьПредупреждение(,"Значение количества в столбце  ""Отказ""  не может  превышать  расчетного значения  
			|(разница количества  в  столбцах ""Требуется доизготовить""  и ""Доизготовить""), 
			|уменьшите количество в столбце ""Отказ"" до необходимого расчетного значения!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ИТБК_ДоизготовлениеНоменклатураПриИзмененииНаСервере(ИД)
	строка = объект.ИТБК_Доизготовление.НайтиПоИдентификатору(ИД);
	Если не ЗначениеЗаполнено(строка.СтатьяРасходов) тогда
		строка.СтатьяРасходов = Константы.ИТБК_СтатьяДоизготовления.Получить();
		строка.АналитикаРасходов =  ?(объект.ИТБК_АктИзготовления <> Неопределено, объект.ИТБК_АктИзготовления.Номенклатура,Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_ДоизготовлениеНоменклатураПриИзменении(Элемент)
	ИД = Элементы.ИТБК_Доизготовление.ТекущаяСтрока;
	ИТБК_ДоизготовлениеНоменклатураПриИзмененииНаСервере(ИД);
КонецПроцедуры

&НаСервере
Процедура ИТБК_СтатусПриИзмененииНаСервере()
	
	Элементы.ГруппаОсновное.ТолькоПросмотр = объект.ИТБК_Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;	
	Элементы.ИТБК_Доизготовление.ТолькоПросмотр = объект.ИТБК_Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_СтатусПриИзменении(Элемент)
	
	ИТБК_СтатусПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ИТБК_СтатусПриИзмененииНаСервере();
	ПриЧтенииСозданииНаСервере();  // fix Designer09.09.2021 4:38:28
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_ДоизготовлениеДоизготовлениеПриИзменении(Элемент)
    
	//Если  Элементы.ИТБК_Доизготовление.ТекущиеДанные.Количество + Элементы.ИТБК_Доизготовление.ТекущиеДанные.Отказ >  Элементы.ИТБК_Доизготовление.ТекущиеДанные.ТребуетсяДоизготовить  тогда
	//    Элементы.ИТБК_Доизготовление.ТекущиеДанные.Количество  = Элементы.ИТБК_Доизготовление.ТекущиеДанные.ТребуетсяДоизготовить - Элементы.ИТБК_Доизготовление.ТекущиеДанные.Отказ;
	//КонецЕсли;
КонецПроцедуры

// begin fix Designer09.09.2021 4:28:49

&НаСервере
Процедура ИзменитьЗаголовок()
	
	АвтоЗаголовок = Истина;
	Заголовок = "";
	АвтоЗаголовок = Ложь;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Доизготовление %1 от %2'"),
			Объект.Номер,
			Объект.Дата);
	Иначе
		Заголовок = НСтр("ru = 'Доизготовление (создание)'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ИзменитьЗаголовок();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	ИзменитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_ДоизготовлениеПередНачаломИзменения(Элемент, Отказ)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Серия) 
		и Элемент.ТекущийЭлемент.Имя = "ИТБК_ДоизготовлениеДоизготовление" Тогда
		Элемент.ТекущиеДанные.Количество = Мин(Элемент.ТекущиеДанные.Количество,1); 
	ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.Серия) 
		и Элемент.ТекущийЭлемент.Имя = "ИТБК_ДоизготовлениеОтказ" Тогда
		Элемент.ТекущиеДанные.Отказ = Мин(Элемент.ТекущиеДанные.Отказ,1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_ДоизготовлениеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Серия) 
		и Элемент.ТекущийЭлемент.Имя = "ИТБК_ДоизготовлениеДоизготовление" 
		и (Элемент.ТекущиеДанные.Количество > 1 
		или Элемент.ТекущиеДанные.Количество + Элемент.ТекущиеДанные.Отказ > 1) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Нельзя для экземплярного товара указывать значение в сумме колонок ""Количество"" и ""Отказ"" больше 1.'"),30);
		Отказ = Истина;
	ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.Серия) 
		и Элемент.ТекущийЭлемент.Имя = "ИТБК_ДоизготовлениеОтказ" 
		и (Элемент.ТекущиеДанные.Отказ > 1 
		или Элемент.ТекущиеДанные.Количество + Элемент.ТекущиеДанные.Отказ > 1) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Нельзя для экземплярного товара указывать значение в сумме колонок ""Количество"" и ""Отказ"" больше 1.'"),30);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_ДоизготовлениеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ТЗ = Объект.ИТБК_Доизготовление.Выгрузить(); 
	Объект.vs_Доизготовление.Загрузить(ТЗ);
КонецПроцедуры

// end fix Designer09.09.2021 4:29:07

//&НаКлиенте
//Процедура ИТБК_ДоизготовлениеСтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//		СтандартнаяОбработка = Ложь;
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.ИТБК_Доизготовление.ТекущаяСтрока);
//	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Статья", Элементы.ИТБК_Доизготовление.ТекущиеДанные.СтатьяРасходов);
//	ПараметрыФормы.Вставить("ПараметрыВыбора", Элемент.ПараметрыВыбора);
//	
//	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);

//КонецПроцедуры


//&НаКлиенте
//Процедура ИТБК_ДоизготовлениеАналитикаРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

//КонецПроцедуры

//&НаКлиенте
//Процедура СтатьяРасходовВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Строка = Объект.ИТБК_Доизготовление.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
//	Строка.СтатьяРасходов = Результат;
//	ТоварыСтатьяРасходовПриИзмененииСервер();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ТоварыСтатьяРасходовПриИзмененииСервер()
//	
//	СтрокаТаблицы = Объект.ИТБК_Доизготовление.НайтиПоИдентификатору(Элементы.ИТБК_Доизготовление.ТекущаяСтрока);
//	
//	Если ТипЗнч(СтрокаТаблицы.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
//		ДоходыИРасходыСервер.СтатьяАктивовПассивовПриИзменении(Объект, СтрокаТаблицы.СтатьяРасходов, СтрокаТаблицы.АналитикаАктивовПассивов);
//		Если ЗначениеЗаполнено(СтрокаТаблицы.АналитикаРасходов) Тогда
//			СтрокаТаблицы.АналитикаРасходов = Неопределено;
//			СтрокаТаблицы.АналитикаРасходовОбязательна = Ложь;
//			СтрокаТаблицы.АналитикаРасходовЗаказРеализация = Ложь;
//		КонецЕсли;
//	Иначе
//		ДоходыИРасходыСервер.СтатьяРасходовПриИзменении(Объект, СтрокаТаблицы.СтатьяРасходов, СтрокаТаблицы.АналитикаРасходов);
//		Если ЗначениеЗаполнено(СтрокаТаблицы.АналитикаАктивовПассивов) Тогда
//			СтрокаТаблицы.АналитикаАктивовПассивов = Неопределено;
//		КонецЕсли;
//	КонецЕсли;
//	
//	СтруктураДействий = Новый Структура("
//		|ЗаполнитьПризнакАналитикаРасходовОбязательна,
//		|ЗаполнитьПризнакАналитикаРасходовЗаказРеализация,
//		|ЗаполнитьТипСтатьи");
//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, Неопределено);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ИТБК_ДоизготовлениеСтатьяРасходовПриИзменении(Элемент)
//		ТоварыСтатьяРасходовПриИзмененииСервер();

//КонецПроцедуры
